conf/src/Catalogs/ФормыОбъектовМетаданных/ФормыОбъектовМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФормыОбъектовМетаданных</name>
  <owners>Catalog.ОбъектыМетаданных</owners>
  <attributes>
    <name>uuid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеТиповФормы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСправкуВСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТехническийПроектИсточник</name>
    <type>
      <types>CatalogRef.ТехническиеПроекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисутствуетВОсновномХранилище</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВеткаИсточник</name>
    <type>
      <types>CatalogRef.Ветки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыФормы</name>
    <attributes>
      <name>ТипФормы</name>
      <type>
        <types>EnumRef.ТипыФорм</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/Enums/ТипыФорм/ТипыФорм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыФорм</name>
  <enumValues>
    <name>ОсновнаяФормаОбъекта</name>
  </enumValues>
  <enumValues>
    <name>ОсновнаяФормаГруппы</name>
  </enumValues>
  <enumValues>
    <name>ОсновнаяФормаСписка</name>
  </enumValues>
  <enumValues>
    <name>ОсновнаяФормаДляВыбора</name>
  </enumValues>
  <enumValues>
    <name>ОсновнаяФормаДляВыбораГруппы</name>
  </enumValues>
  <enumValues>
    <name>ОсновнаяФорма</name>
  </enumValues>
  <enumValues>
    <name>ОсновнаяФормаНастроек</name>
  </enumValues>
  <enumValues>
    <name>ОсновнаяФормаВарианта</name>
  </enumValues>
  <enumValues>
    <name>ОсновнаяФормаЗаписи</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольнаяФорма</name>
  </enumValues>
  <enumValues>
    <name>ОбщаяФорма</name>
  </enumValues>
  <enumValues>
    <name>ДополнительнаяФорма</name>
  </enumValues>
  <enumValues>
    <name>ОсновнаяФормаЗагрузки</name>
  </enumValues>
  <enumValues>
    <name>ОсновнаяФормаСохранения</name>
  </enumValues>
</mdclass:Enum>

conf/src/Enums/ТипыВеток/ТипыВеток.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВеток</name>
  <enumValues>
    <name>ОсновнаяВеткаПроекта</name>
  </enumValues>
  <enumValues>
    <name>ВеткаВерсии</name>
  </enumValues>
  <enumValues>
    <name>ВеткаТехническогоПроекта</name>
  </enumValues>
  <enumValues>
    <name>ВеткаДляИсправленияОшибок</name>
  </enumValues>
</mdclass:Enum>

conf/src/Catalogs/ОбъектыМетаданных/ОбъектыМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыМетаданных</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>uuid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидИерархии</name>
    <type>
      <types>EnumRef.ВидыИерархии</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбъектаМетаданныхВЕдЧисле</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегистраНакопления</name>
    <type>
      <types>EnumRef.ВидыРегистровНакопления</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСправкуВСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеОписаниеОграниченийДоступа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеПраво</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВводНаОсновании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьДвиженияДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьДвиженияПоРегистру</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьКоманды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьМакеты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОграниченияДоступа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПрава</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПредопределенныеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРеквизиты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСправочнаяИнформация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСсылкиИзОбъектовМетаданных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьФормы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСтандартныеКоманды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеразделенныеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Пояснение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоПоддержки</name>
    <type>
      <types>EnumRef.ПравилаПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВидаОбъектаМетаданныхВЕдЧисле</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеСписка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПривилегированныйРежимПриОтменеПроведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПривилегированныйРежимПриПроведении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисутствуетВОсновномХранилище</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделПроекта</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенноеПредставлениеОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасширенноеПредставлениеСписка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрПодчиненРегистратору</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РольДляВсехПрофилейПользователей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РольСоздаетсяВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТехническийПроектИсточник</name>
    <type>
      <types>CatalogRef.ТехническиеПроекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СинонимДополнительный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереводПроверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеИзменений</name>
    <type>
      <types>EnumRef.ВариантыСогласованияИзмененияВВетках</types>
    </type>
  </attributes>
  <attributes>
    <name>ВеткаИсточник</name>
    <type>
      <types>CatalogRef.Ветки</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласующийИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭП_НеПоказыватьНаДиаграмме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВводитсяНаОсновании</name>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>CatalogRef.ОбъектыМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОписаниеДвиженийПоРегистру</name>
    <attributes>
      <name>Регистратор</name>
      <type>
        <types>CatalogRef.ОбъектыМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидДвиженияРегистра</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеДвижения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазделыПроекта</name>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>CatalogRef.РазделыПроекта</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/Catalogs/ФормыОбъектовМетаданных/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает список реквизитов, которые разрешается редактировать
// с помощью обработки группового изменения объектов
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	РедактируемыеРеквизиты = Новый Массив;
	
	РедактируемыеРеквизиты.Добавить("Ответственный");
	
	Возврат РедактируемыеРеквизиты;
	
КонецФункции

Функция СформироватьПечатныеФормы(Объекты, СУчетомПриемника=Ложь, ДанныеСоответствия=Неопределено) Экспорт
	
	Если ТипЗнч(Объекты) = Тип("Массив") Тогда
		МассивСсылок = Объекты;
	Иначе
		МассивСсылок = Новый Массив;
		МассивСсылок.Добавить(Объекты);
	КонецЕсли;
	
	ПечатныеФормы = Новый Соответствие;
	
	Для Каждого Ссылка из МассивСсылок Цикл
		
		СтруктураПечатныхФорм = Новый Структура();
		СтруктураПечатныхФорм.Вставить("ВариантыСправки", ФормированиеСправкиСервер.СформироватьВариантыСправки(Ссылка));
		
		ПечатныеФормы.Вставить(Ссылка, СтруктураПечатныхФорм);
		
	КонецЦикла;
	
	Возврат ПечатныеФормы;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Владелец.Владелец)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	Если НЕ Параметры.Отбор.Свойство("Владелец")
	 ИЛИ НЕ ЗначениеЗаполнено(Параметры.Отбор.Владелец)
	 ИЛИ ТипЗнч(Параметры.Отбор.Владелец) <> Тип("СправочникСсылка.ОбъектыМетаданных") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбъектыМетаданных.Родитель.Имя КАК ИмяКлассаМетаданных
	|ИЗ
	|	Справочник.ОбъектыМетаданных КАК ОбъектыМетаданных
	|ГДЕ
	|	ОбъектыМетаданных.Ссылка = &Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Формы.Ссылка КАК Значение,
	|	Формы.Представление КАК Представление
	|ИЗ
	|	Справочник.ФормыОбъектовМетаданных КАК Формы
	|ГДЕ //%1
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление";
	
	ТекстОтбора = "";
	Для Каждого КлючИЗначение Из Параметры.Отбор Цикл
		ТекстОтбора = ТекстОтбора + "
			|	" + ?(ТекстОтбора = "", "", " И ") + "Формы." + КлючИЗначение.Ключ + " = &" + КлючИЗначение.Ключ;
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Параметры.СтрокаПоиска) Тогда
		ТекстОтбора = ТекстОтбора + "
			|	И (Формы.Имя ПОДОБНО &СтрокаПоиска
			|		ИЛИ Формы.Наименование ПОДОБНО &СтрокаПоиска)";
		Запрос.УстановитьПараметр("СтрокаПоиска", Параметры.СтрокаПоиска + "%");
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "//%1", ТекстОтбора);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	Выборка = Результаты[0].Выбрать();
	Если Выборка.Следующий() Тогда
		
		СписокТиповФорм = РаботаСОбъектамиМетаданныхКлиентСервер.СписокДоступныхТиповФорм(Выборка.ИмяКлассаМетаданных);
		
		Для Каждого ТекЭлемент Из СписокТиповФорм Цикл
			
			Если ТекЭлемент.Значение = Перечисления.ТипыФорм.ПроизвольнаяФорма Тогда
				Продолжить;
			КонецЕсли;
			
			ПредставлениеФормы = СокрЛП(ТекЭлемент.Значение);
			Если ЗначениеЗаполнено(Параметры.СтрокаПоиска)
			 И Найти(НРег(ПредставлениеФормы), НРег(Параметры.СтрокаПоиска)) <> 1 Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеВыбора.Добавить(ТекЭлемент.Значение, ПредставлениеФормы);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Выборка = Результаты[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Значение, Выборка.Представление);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеЗаполненияВеткиИсточника(Параметры) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ФормыОбъектовМетаданных.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ФормыОбъектовМетаданных КАК ФормыОбъектовМетаданных
	|ГДЕ
	|	ФормыОбъектовМетаданных.УдалитьТехническийПроектИсточник <> ЗНАЧЕНИЕ(Справочник.ТехническиеПроекты.ПустаяСсылка)
	|	И ФормыОбъектовМетаданных.УдалитьТехническийПроектИсточник.Ветка.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыВеток.ВеткаТехническогоПроекта)
	|	И ФормыОбъектовМетаданных.ВеткаИсточник = ЗНАЧЕНИЕ(Справочник.Ветки.ПустаяСсылка)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбработатьДанныеДляЗаполненияВеткиИсточника(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "Справочник.ФормыОбъектовМетаданных";
	
	СписокОбъектов = Новый Массив;
	
	ВыборкаОбъектовДляОбработки = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
	Пока ВыборкаОбъектовДляОбработки.Следующий() Цикл
		СписокОбъектов.Добавить(ВыборкаОбъектовДляОбработки.Ссылка);
	КонецЦикла;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ФормыОбъектовМетаданных.Ссылка КАК Ссылка,
	|	ФормыОбъектовМетаданных.УдалитьТехническийПроектИсточник.Ветка КАК ВеткаИсточник
	|ИЗ
	|	Справочник.ФормыОбъектовМетаданных КАК ФормыОбъектовМетаданных
	|ГДЕ
	|	ФормыОбъектовМетаданных.Ссылка В(&СписокОбъектов)"
	;
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокОбъектов", СписокОбъектов);
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			
			НачатьТранзакцию();
						
			// Устанавливаем управляемую блокировку, чтобы провести ответственное чтение объекта
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			
			Блокировка.Заблокировать();
			
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			
			Если Объект = Неопределено Тогда
				ОтменитьТранзакцию();
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.ВеткаИсточник) Тогда
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Объект);
			Иначе
				Объект.ВеткаИсточник = Выборка.ВеткаИсточник;
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(Объект);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			
		Исключение
			
			ОтменитьТранзакцию();
			
			МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъекта);
			
			ТекстСообщения = НСтр("ru = 'Не удалось указать ветку-источник для объекта %ИмяОбъекта%: %Ссылка% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяОбъекта%", ПолноеИмяОбъекта);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", Выборка.Ссылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			                         УровеньЖурналаРегистрации.Предупреждение,
			                         МетаданныеОбъекта,
			                         Выборка.Ссылка,
			                         ТекстСообщения);
			
		КонецПопытки;
									
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = 
		Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
